{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "B-category",
    "1": "B-color",
    "2": "B-embellishment",
    "3": "B-fabric",
    "4": "B-length",
    "5": "B-neckline",
    "6": "B-silhouette",
    "7": "B-sleeve",
    "8": "I-category",
    "9": "I-color",
    "10": "I-embellishment",
    "11": "I-fabric",
    "12": "I-length",
    "13": "I-neckline",
    "14": "I-silhouette",
    "15": "I-sleeve",
    "16": "O"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-category": 0,
    "B-color": 1,
    "B-embellishment": 2,
    "B-fabric": 3,
    "B-length": 4,
    "B-neckline": 5,
    "B-silhouette": 6,
    "B-sleeve": 7,
    "I-category": 8,
    "I-color": 9,
    "I-embellishment": 10,
    "I-fabric": 11,
    "I-length": 12,
    "I-neckline": 13,
    "I-silhouette": 14,
    "I-sleeve": 15,
    "O": 16
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "vocab_size": 30522
}
